<template>
  <div id="phone">
    <div class="header">
      <div class="up">
        <span class="time">19:19</span>
        <div class="top"></div>
        <i
          ><svg
            t="1651078343215"
            class="icon"
            viewBox="0 0 1024 1024"
            version="1.1"
            xmlns="http://www.w3.org/2000/svg"
            p-id="6754"
            width="25"
            height="25"
          >
            <path
              d="M145.8 675h535.6V349.3H145.8V675z m773.7-244.3v-81.4c0-44.8-36.6-81.4-81.4-81.4H145.8c-44.8 0-81.4 36.6-81.4 81.4V675c0 44.8 36.6 81.4 81.4 81.4H838c44.8 0 81.4-36.6 81.4-81.4v-81.4c22.4 0 40.7-18.3 40.7-40.7v-81.4c0.1-22.4-18.2-40.8-40.6-40.8z m-40.7 40.8V675c0 22.4-18.3 40.7-40.7 40.7H145.8c-22.4 0-40.7-18.3-40.7-40.7V349.3c0-22.4 18.3-40.7 40.7-40.7H838c22.4 0 40.7 18.3 40.7 40.7v122.2h0.1z"
              fill=" #f5f5f5"
              p-id="6755"
            ></path></svg
        ></i>
        <span class="power">100%</span>
      </div>
      <div class="down">
        <span>简单优购</span>
        <div class="down-btn">
          <i
            ><svg
              t="1651073056837"
              class="icon"
              viewBox="0 0 1024 1024"
              version="1.1"
              xmlns="http://www.w3.org/2000/svg"
              p-id="8555"
              width="20"
              height="20"
            >
              <path
                d="M344 511.992a168 168 0 1 0 336 0 168 168 0 1 0-336 0zM744 512a120 120 0 1 0 240 0 120 120 0 1 0-240 0zM40.32 512a120 120 0 1 0 240 0 120 120 0 1 0-240 0z"
                p-id="8556"
              ></path></svg
          ></i>
          <i
            ><svg
              t="1651073267715"
              class="icon"
              viewBox="0 0 1024 1024"
              version="1.1"
              xmlns="http://www.w3.org/2000/svg"
              p-id="9380"
              width="25"
              height="25"
            >
              <path
                d="M483.555556 312.888889m28.444444 0l0 0q28.444444 0 28.444444 28.444444l0 341.333334q0 28.444444-28.444444 28.444444l0 0q-28.444444 0-28.444444-28.444444l0-341.333334q0-28.444444 28.444444-28.444444Z"
                p-id="9381"
              ></path></svg
          ></i>
          <i
            ><svg
              t="1651072941020"
              class="icon"
              viewBox="0 0 1024 1024"
              version="1.1"
              xmlns="http://www.w3.org/2000/svg"
              p-id="7053"
              width="20"
              height="20"
            >
              <path
                d="M512 0C228.96 0 0 228.96 0 512c0 283.04 228.96 512 512 512 283.04 0 512-228.96 512-512C1024 228.96 795.04 0 512 0z m0 903.52c-216.8 0-391.52-174.72-391.52-391.52 0-216.8 174.72-391.52 391.52-391.52 216.8 0 391.52 174.72 391.52 391.52 0 216.8-174.72 391.52-391.52 391.52z"
                fill="#515151"
                p-id="7054"
              ></path>
              <path
                d="M316.16 512c0 108.16 87.68 195.84 195.84 195.84S707.84 620.16 707.84 512 620.16 316.16 512 316.16 316.16 403.84 316.16 512z m0 0"
                fill="#515151"
                p-id="7055"
              ></path></svg
          ></i>
        </div>
      </div>
    </div>
    <div class="content">
      <div class="view">
        <p>
          本文介绍了四种清除浮动的方法，并尝试解释其原理。在理解了各种清除浮动的原理之后，你会发现，很多清除浮动的方法本质上其实是一样的。掌握这些原理，相信你可以根据场景和需求，灵活运用原则发展出不同的清除浮动的方法，而不再死记或拘泥于文中提到的方法。
          一、为什么要清除浮动
          在讲清除浮动的方法之前，我们先来了解一下为什么要清除浮动，清除浮动的目的是什么，即，要解决什么样的问题。来看一个浮动的例子(略去了文字内容)：
          复制代码其样式为： .topDiv { width: 500px; border: 2px solid black; }
          .floatDiv { width: 100px; height: 100px; border: 2px dotted red;
          color: red; margin: 4px; float: left; } .bottomDiv { width: 500px;
          height: 100px; margin: 5px 0; border: 2px dotted black; } .textDiv {
          color: blue; border: 2px solid blue;
          }复制代码在chrome中渲染的效果如下图所示： 浮动效果
          这肯定不是我们想要的渲染效果，它可能存在如下问题：
          文字围绕浮动元素排版，但我们可能希望文字（.textDiv）排列在浮动元素下方，或者，我们并不希望.textDiv两边有浮动元素存在。
          浮动元素排版超出了其父级元素（.topDiv），父元素的高度出现了塌缩，若没有文字高度的支撑，不考虑边框，父级元素高度会塌缩成零。
          浮动元素甚至影响到了其父元素的兄弟元素（.bottomDiv）排版。因为浮动元素脱离了文档流，.bottomDiv在计算元素位置的时候会忽略其影响，紧接着上一个元素的位置继续排列。
          解决第一个问题，需要清除.textDiv周围的浮动，而解决第二个问题，因为父元素的兄弟元素位置只受父元素位置的影响，就需要一种方法将父级元素的高度撑起来，将浮动元素包裹在其中，避免浮动元素影响父元素外部的元素排列。
          接下来开始介绍清除浮动的方法。 二、清除浮动的方法 1. 利用clear样式
          还是开篇的例子，我们给需要清除浮动的元素添加如下样式： .textDiv {
          color: blue; border: 2px solid blue; clear: left;
          }复制代码清除浮动后的渲染效果如下： 解释一下：
          通过上面的样式，.textDiv告诉浏览器，我的左边不允许有浮动的元素存在，请清除掉我左边的浮动元素。然而，因为浮动元素（.floatDiv）位置已经确定，浏览器在计算.textDiv的位置时，为满足其需求，将.textDiv渲染在浮动元素下方，保证了.textDiv左边没有浮动元素。同时可以看出，父元素的高度也被撑起来了，其兄弟元素的渲染也不再受到浮动的影响，这是因为.textDiv仍然在文档流中，它必须在父元素的边界内，父元素只有增加其高度才能达到此目的，可以说是一个意外收获。(clear的值为both也有相同的效果，通俗理解就是，哪边不允许有浮动元素，clear就是对应方向的值，两边都不允许就是both)
          但是，如果我们把HTML中的.floatDiv和.textDiv交换一下位置呢？
        </p>
      </div>
    </div>

    <div class="footer">
      <ul>
        <li>
          <svg
            t="1651075398770"
            class="icon"
            viewBox="0 0 1033 1024"
            version="1.1"
            xmlns="http://www.w3.org/2000/svg"
            p-id="10337"
            width="25"
            height="25"
          >
            <path
              d="M1002.599861 500.663121l-17.112402 17.112402c-4.889258 4.889258-12.223144 4.889258-17.124938 0l-36.669433-34.224803v339.891165c0 110.033371-90.47634 200.509711-200.509711 200.509711H278.814212c-112.478 2.444629-202.95434-88.031712-202.954341-198.065082V483.55072l-34.23734 34.224803c-4.889258 4.889258-12.223144 4.889258-17.112402 0l-17.112402-17.112402c-4.889258-4.889258-4.889258-12.223144 0-17.112401L489.102438 1.833472c2.444629-2.444629 9.778515-2.444629 14.667774 0 4.889258-2.444629 12.223144-2.444629 17.124938 0l481.704711 481.717248c4.889258 4.889258 4.889258 12.223144 0 17.112401zM403.515356 950.587658c0 9.778515 2.444629 17.124938 2.444629 24.458825H626.039263c2.444629-7.333887 2.444629-17.124938 2.444629-24.458825v-276.305742c0-56.239-44.015856-100.254856-100.254855-100.254856h-24.458825c-56.239 0-100.254856 44.015856-100.254856 100.254856v276.305742zM880.343346 434.645606L503.770212 58.085008 127.209614 434.645606v391.240908c0 83.142454 68.462144 151.604598 151.604598 151.604598h78.240659c-2.444629-7.333887-2.444629-17.112402-2.444629-24.446289V674.269379c0-83.142454 68.462144-151.604598 151.604598-151.604598h24.446289c83.142454 0 151.604598 68.462144 151.604598 151.604598v276.305742c0 9.778515 0 17.124938-2.444629 24.458825h53.794371c83.142454 0 151.604598-68.462144 151.604598-151.604598V434.645606h-4.876721z m0 0"
              p-id="10338"
            ></path></svg
          ><i>首页</i>
        </li>
        <li>
          <svg
            t="1651075437486"
            class="icon"
            viewBox="0 0 1024 1024"
            version="1.1"
            xmlns="http://www.w3.org/2000/svg"
            p-id="11171"
            width="25"
            height="25"
          >
            <path
              d="M436.3 175.5C256.2 194.3 100.5 357 100.5 550c0 206.8 167.7 374.5 374.5 374.5 152.3 0 283.2-91.1 341.7-221.7L436.3 588.7V175.5zM487.9 98v446.8l411.9 123.6c16-39.8 27.2-87.7 27.2-142.4 0-236.4-220.7-428-439.1-428z"
              p-id="11172"
            ></path></svg
          ><i>分类</i>
        </li>
        <li>
          <svg
            t="1651075466468"
            class="icon"
            viewBox="0 0 1024 1024"
            version="1.1"
            xmlns="http://www.w3.org/2000/svg"
            p-id="12683"
            width="25"
            height="25"
          >
            <path
              d="M352.456912 832.032253c-35.434907 0-63.989249 28.554342-63.989249 63.989249 0 35.434907 28.554342 63.989249 63.989249 63.989249s63.989249-28.554342 63.989249-63.989249C416.446162 860.586595 387.891819 832.032253 352.456912 832.032253L352.456912 832.032253z"
              p-id="12684"
            ></path>
            <path
              d="M800.55367 832.032253c-35.434907 0-63.989249 28.554342-63.989249 63.989249 0 35.434907 28.554342 63.989249 63.989249 63.989249s63.989249-28.554342 63.989249-63.989249C864.54292 860.586595 835.816563 832.032253 800.55367 832.032253L800.55367 832.032253z"
              p-id="12685"
            ></path>
            <path
              d="M864.026877 800.037628 344.200235 800.037628c-46.099782 0-86.695112-36.466991-92.199563-83.082815l-54.356459-382.043339L166.853687 156.360826c-1.892155-15.653284-16.169326-28.382328-29.930455-28.382328L95.983874 127.978498c-17.717453 0-31.994625-14.277171-31.994625-31.994625s14.277171-31.994625 31.994625-31.994625l40.767344 0c46.615824 0 87.727196 36.466991 93.403662 83.082815l30.790526 177.86259L315.473879 708.698135c1.720141 14.793214 15.309256 27.350244 28.726356 27.350244l519.826642 0c17.717453 0 31.994625 14.277171 31.994625 31.994625S881.744331 800.037628 864.026877 800.037628z"
              p-id="12686"
            ></path>
            <path
              d="M384.279523 672.05913c-16.685369 0-30.618512-12.729044-31.82261-29.586427-1.376113-17.545439 11.868974-33.026709 29.586427-34.230808l434.163615-31.994625c15.997312-0.172014 29.414413-12.55703 31.134554-26.834201l50.400134-288.295649c1.204099-10.664875-1.720141-22.533848-8.084663-29.758441-4.128339-4.644381-9.288762-7.052579-15.309256-7.052579L319.946246 224.3064c-17.717453 0-31.994625-14.277171-31.994625-31.994625S302.400806 159.973123 319.946246 159.973123l554.05745 0c24.426004 0 46.959852 10.148833 63.301193 28.554342 18.749538 21.157736 27.178229 50.744163 23.565933 81.706703l-50.400134 288.467663c-5.504452 44.895683-45.927768 81.362674-92.027549 81.362674l-431.755417 31.82261C385.82765 671.887116 384.967579 672.05913 384.279523 672.05913z"
              p-id="12687"
            ></path></svg
          ><i>购物车</i>
        </li>
        <li>
          <svg
            t="1651075490712"
            class="icon"
            viewBox="0 0 1024 1024"
            version="1.1"
            xmlns="http://www.w3.org/2000/svg"
            p-id="13511"
            width="25"
            height="25"
          >
            <path
              d="M970.142125 887.350303c-0.271515-3.84-0.827475-9.671111-1.82303-17.260606-1.848889-14.157576-4.615758-29.853737-8.494546-46.713535-11.080404-48.122828-28.935758-96.271515-55.169292-141.433536-68.926061-118.600404-181.772929-194.314343-344.901819-206.62303 95.883636-21.837576 167.421414-107.545859 167.421415-209.945859 0-118.923636-96.504242-215.337374-215.544243-215.337373-119.04 0-215.544242 96.413737-215.544242 215.337373 0 102.412929 71.550707 188.108283 167.434343 209.958788-163.128889 12.308687-275.975758 88.048485-344.914747 206.674748-26.233535 45.16202-44.088889 93.323636-55.182223 141.459394-3.878788 16.859798-6.658586 32.568889-8.507474 46.726464-1.021414 7.848081-1.590303 13.808485-1.83596 17.635556-6.270707 48.032323 29.013333 88.177778 77.795556 88.177778h761.483636c49.027879 0 85.061818-40.572121 77.782626-88.656162zM353.570004 265.373737c0-87.22101 70.76202-157.918384 158.060606-157.918383 87.298586 0 158.060606 70.697374 158.060606 157.918383S598.916267 423.292121 511.63061 423.292121c-87.285657 0-158.060606-70.697374-158.060606-157.918384z m538.815354 653.213738H130.888792c-14.235152 0-22.794343-9.865051-20.751515-23.815758l0.193939-1.292929 0.064647-1.305859c0.025859-0.426667 0.103434-1.564444 0.271515-3.361616 0.284444-3.180606 0.698182-6.930101 1.254141-11.196768 1.616162-12.373333 4.059798-26.259394 7.511919-41.257373 9.87798-42.873535 25.755152-85.721212 48.885657-125.517576 65.512727-112.756364 175.127273-179.872323 343.311515-179.872323 168.197172 0 277.798788 67.10303 343.311515 179.820606 23.117576 39.770505 38.994747 82.605253 48.872728 125.478788 3.452121 14.985051 5.908687 28.858182 7.511919 41.244444 0.55596 4.266667 0.969697 8.016162 1.241212 11.196768 0.168081 1.797172 0.245657 2.92202 0.271515 3.361616l0.090505 1.667879 0.284444 1.64202c2.301414 13.239596-6.412929 23.208081-20.82909 23.208081z m0 0"
              p-id="13512"
            ></path></svg
          ><i>我的</i>
        </li>
      </ul>
    </div>
  </div>
</template>

<script>
export default {
  components: {},
};
</script>

<style scoped>
#phone {
  -webkit-font-smoothing: antialiased;
  -moz-osx-font-smoothing: grayscale;
  margin-top: 60px;

  width: 100%;
  position: relative;
  width: 350px;
  height: 750px;
  border-radius: 12px;
  left: 50%;
  transform: translate(-50%, 0);
}

#phone .header .content .footer {
  width: 100%;
}
#phone .header {
  position: relative;
  height: 80px;
  background-color: #c00000;
  border-radius: 30px 30px 0 0;
}
.header .up,
.down {
  position: relative;
  height: 40px;
}
.header .up span.time {
  float: left;
  margin: 12px 0 0 15px;
  font-size: small;
  color: #f5f5f5;
}
.header .up span.power {
  float: right;
  margin: 12px 5px 0 0;
  font-size: small;
  color: #f5f5f5;
}
.header .up i {
  float: right;
  margin: 10px 7px 0 0;
  color: #f5f5f5;
}
.header .up .top {
  position: absolute;
  width: 195px;
  height: 30px;
  background-color: black;
  border-radius: 0 0 20px 20px;

  left: 50%;
  transform: translate(-50%, 0);
}

.header .down .down-btn {
  display: flex;
  justify-content: center;
  align-items: center;
  float: right;

  margin: 2px 5px 0 0;
  width: 80px;
  height: 30px;
  background-color: #c4c4c4;
  border-radius: 20px;
}
.header .down .down-btn i {
  margin-top: 4px;
}
.header .down span {
  position: absolute;
  left: 50%;
  top: 50%;
  transform: translate(-50%, -50%);
  font-size: small;
  color: #f5f5f5;
}

.content {
  /* flex: 1 1 auto; */
  position: relative;
  overflow: scroll;
  height: 590px;
  background-color: #f5f5f5;
}
.content .view {
  position: relative;
  /* margin: 0 2px 0 2px; */
}

.footer {
  height: 75px;
  background-color: #f8f8ff;
  border-radius: 0 0 30px 30px;
}
.footer ul {
  display: flex;
  list-style-type: none;
  margin-top: 0;
}
.footer ul li {
  flex: 1;
}
.footer ul li i {
  font-weight: 400;
  font-style: normal;
  font-size: small;
}
.footer ul li svg {
  display: block;
  margin-top: 10px;
}
</style>
